{
  "course": [
    {
      "id": 1,
      "title": "Internet Training",
      "description": "Become proficient in using the internet for communication, research, and productivity.",
      "description2": "Master the essential skills needed to navigate and utilize the internet effectively for personal and professional use. Learn how to browse safely, use email and cloud services, conduct efficient research, and access online tools for learning, collaboration, and remote work. This training empowers you to stay connected, informed, and digitally competent in today’s fast-paced online world.",
      "price": "Starting Price: ₦15,000",
      "level": "Beginner",
      "duration": "1-2 Months",
      "color": "#3B82F6",
      "icon": "🌐",
      "features": ["Certificate of completion"],
      "learningOutcomes": [
        "Understanding internet basics: browsers, search engines, and online navigation",
        "Creating and managing email accounts (Gmail, Yahoo, etc.)",
        "Using search engines effectively for research and learning",
        "Introduction to cloud tools like Google Drive and OneDrive",
        "Understanding cybersecurity basics: passwords, phishing, and safe browsing",
        "Utilizing online platforms for learning and communication (Zoom, Google Meet)",
        "Accessing social media for professional networking and branding",
        "Hands-on practice with online forms, surveys, and submissions",
        "Introduction to e-commerce and digital payments",
        "Using Google Docs, Sheets, and Slides for productivity",
        "Collaborative tools and cloud sharing techniques",
        "Navigating online job platforms and remote work opportunities"
      ]
    },
    {
      "id": 2,
      "title": "Desktop Publishing",
      "description": "Master professional document design and layout techniques",
      "description2": "Master professional document design and layout techniques that bring clarity, consistency, and visual appeal to your work. Learn how to apply advanced formatting, align content for readability, and use typography, spacing, and color schemes to enhance message delivery. You’ll also gain skills in structuring multi-page reports, brochures, proposals, and branded templates that reflect industry-standard quality and professional excellence across various platforms.",
      "price": "Starting Price: ₦20,000",
      "level": "Beginner",
      "duration": "2-3 Months",
      "color": "#10B981",
      "icon": "📊",
      "features": ["Certificate of completion"],
      "learningOutcomes": [
        "Introduction to Desktop Publishing and its real-world applications",
        "Mastery of Microsoft Word: formatting, templates, mail merge, and page design",
        "Creating professional spreadsheets and charts using Microsoft Excel",
        "Using Excel functions and formulas for data analysis and reporting",
        "Designing engaging presentations with Microsoft PowerPoint",
        "Inserting animations, transitions, multimedia, and SmartArt in slides",
        "File management and document security across Office applications",
        "Creating business documents like invoices, letters, and reports",
        "Page layout and document design principles for publishing",
        "Hands-on projects to reinforce practical skills across Office tools",
        "Keyboarding and typing speed improvement techniques",
        "Using Office tools for branding: flyers, business cards, and posters",
        "Collaboration tools: track changes, comments, and cloud sharing"
      ]
    },
    {
      "id": 3,
      "title": "Graphics Design",
      "description": "Create stunning visual designs for digital and print media",
      "description2": "Create stunning visual designs for digital and print media that leave a lasting impression. Learn to bring your creative ideas to life using professional tools and industry-standard techniques. From social media graphics and website banners to brochures, flyers, and business cards, you'll master the art of combining color, typography, and layout to communicate messages effectively across any platform. Whether you're designing for screens or paper, this course equips you with the skills to deliver polished, eye-catching results that meet both creative and professional standards.",
      "price": "Starting Price: ₦60,000",
      "level": "Intermediate",
      "duration": "3-4 Months",
      "color": "#8B5CF6",
      "icon": "🤖",
      "features": ["Certificate of completion"],
      "learningOutcomes": [
        "Introduction to Computer Fundamentals and Office Applications",
        "Basics of Graphic Design Principles and Visual Communication",
        "Proficiency in Microsoft Word: Document formatting, templates, and layout",
        "Microsoft PowerPoint: Creating visually engaging slide presentations",
        "Microsoft Excel: Using spreadsheets for design budgeting and planning",
        "Understanding Color Theory, Typography, and Layouts",
        "Designing Professional Flyers, Posters, and Business Cards",
        "Using Microsoft Publisher for Desktop Publishing",
        "File Management: Saving, exporting, and sharing design files",
        "Applying Design Elements in Real-World Office Tasks",
        "Creating Reports, Infographics, and Visual Data Presentations",
        "Hands-on Practice with Real-Life Design Projects"
      ]
    },
    {
      "id": 4,
      "title": "Computer Engineering",
      "description": "Learn the foundations of hardware, software, and system design.",
      "description2": "Dive into the fundamentals of computer engineering, covering both hardware and software aspects of modern computing systems. Gain practical experience in system architecture, microprocessors, digital electronics, operating systems, and troubleshooting techniques. This course is ideal for those who want to build, maintain, or optimize computing systems and networks in real-world environments.",
      "price": "Starting Price: ₦190,000",
      "level": "Advance",
      "duration": "6-12 Months",
      "color": "#3B82F6",
      "icon": "💻",
      "features": ["Certificate of completion", "Hands-on hardware experience"],
      "learningOutcomes": [
        "Introduction to computer systems and basic components",
        "Understanding the roles of CPU, RAM, storage, and motherboard",
        "Assembling and disassembling desktop PCs and laptops",
        "Identifying and troubleshooting hardware issues",
        "Installing and configuring operating systems (Windows/Linux)",
        "Basic networking concepts and LAN setup",
        "Understanding BIOS/UEFI and system boot processes",
        "Working with microcontrollers and digital logic",
        "Introduction to programming for embedded systems",
        "Preventive maintenance and hardware upgrades",
        "Safe handling and protection of electronic components",
        "Understanding power supply units and circuit diagnostics",
        "Hands-on labs and project-based assessments"
      ]
    },
    {
      "id": 5,
      "title": "Business Machine Techniques",
      "description": "Learn to operate and maintain essential office machines for modern business tasks.",
      "description2": "Gain hands-on knowledge in operating and maintaining key business machines such as photocopiers, scanners, binding machines, laminators, shredders, and multi-function printers. Understand their uses in administrative workflows, improve document handling efficiency, and troubleshoot basic faults. This course empowers you with practical skills needed in today's digital-office environments.",
      "price": "Starting Price: ₦20,000",
      "level": "Beginner",
      "duration": "1-2 Months",
      "color": "#F59E0B",
      "icon": "🖨️",
      "features": ["Certificate of completion"],
      "learningOutcomes": [
        "Understanding the role of business machines in office environments",
        "Hands-on operation of printers, scanners, and copiers",
        "Document finishing techniques: binding, laminating, and cutting",
        "Routine maintenance and safety precautions",
        "Troubleshooting common machine issues",
        "Workplace productivity using business tools",
        "Basic record keeping and inventory of machine supplies"
      ]
    },
    {
      "id": 6,
      "title": "Data Processing",
      "description": "Master the core concepts of data entry, analysis, and digital record keeping.",
      "description2": "This course introduces you to the world of data processing—from data entry to analysis and reporting. Learn to use industry-standard software such as Microsoft Excel, Access, and basic database tools to handle, organize, and interpret structured data for business and academic purposes.",
      "price": "Starting Price: ₦30,000",
      "level": "Intermediate",
      "duration": "2-4 Months",
      "color": "#6366F1",
      "icon": "📈",
      "features": ["Certificate of completion"],
      "learningOutcomes": [
        "Introduction to data types and data structures",
        "Data entry standards and accuracy techniques",
        "Using Microsoft Excel for data sorting, filtering, and formulas",
        "Understanding spreadsheets and cell referencing",
        "Intro to Microsoft Access and relational databases",
        "Data visualization using charts and graphs",
        "Basic data validation and analysis",
        "Creating digital records and generating reports"
      ]
    },
    {
      "id": 7,
      "title": "Laptop Engineering",
      "description": "Learn the fundamentals of laptop hardware maintenance and repair.",
      "description2": "Get trained in diagnosing, servicing, and repairing laptops. From screen replacements to motherboard diagnosis, this course teaches both the theoretical knowledge and hands-on techniques required to service modern laptops professionally. Ideal for aspiring technicians and tech enthusiasts.",
      "price": "Starting Price: ₦150,000",
      "level": "Advance",
      "duration": "3-4 Months",
      "color": "#EF4444",
      "icon": "💻",
      "features": ["Certificate of completion", "Hands-on lab sessions"],
      "learningOutcomes": [
        "Understanding laptop architecture and components",
        "Disassembling and reassembling laptops safely",
        "Screen, keyboard, and touchpad replacements",
        "Battery, RAM, and hard drive upgrades",
        "BIOS flashing and OS installation",
        "Diagnosing power and charging issues",
        "Basic soldering techniques",
        "Troubleshooting hardware and software problems"
      ]
    },
    {
      "id": 8,
      "title": "Computer Engineering",
      "description": "Build a solid foundation in computer hardware, software, and system architecture.",
      "description2": "This course explores both the hardware and software aspects of computer systems. Learn how computers work from the ground up—understanding CPUs, memory, storage, and input/output systems. It also covers installation of operating systems, drivers, and utilities necessary for system performance and optimization.",
      "price": "Starting Price: ₦100,000",
      "level": "Intermediate",
      "duration": "4-6 Months",
      "color": "#0EA5E9",
      "icon": "🖥️",
      "features": ["Certificate of completion", "Real-world projects"],
      "learningOutcomes": [
        "Computer system fundamentals: CPU, RAM, motherboard",
        "PC assembly and troubleshooting",
        "Installing and configuring operating systems",
        "Driver management and software installation",
        "System performance tuning and benchmarking",
        "Troubleshooting hardware conflicts",
        "Power supply and peripheral integration",
        "Health and safety practices in PC repair"
      ]
    },
    {
      "id": 9,
      "title": "Computer Networking",
      "description": "Understand how computer networks are built, configured, and secured.",
      "description2": "Dive into the essentials of computer networking—learn how data flows through wired and wireless networks, understand network protocols, and practice setting up secure and functional network environments. This course is ideal for IT beginners, support staff, and anyone preparing for networking certifications.",
      "price": "Starting Price: ₦70,000",
      "level": "Intermediate",
      "duration": "3-6 Months",
      "color": "#14B8A6",
      "icon": "🌐",
      "features": ["Certificate of completion", "Network simulations"],
      "learningOutcomes": [
        "Introduction to LAN, WAN, and wireless networking",
        "Understanding IP addressing and subnetting",
        "Setting up routers, switches, and access points",
        "Network cabling and signal testing",
        "Understanding TCP/IP and key protocols",
        "Basic network security and firewall configuration",
        "Troubleshooting connectivity issues",
        "Hands-on lab setup using virtual network tools"
      ]
    },
    {
      "id": 10,
      "title": "Programming",
      "description": "Learn to code with modern programming languages and frameworks",
      "description2": "Learn to code with modern programming languages and frameworks that power today’s web and mobile applications. Master essential skills in HTML, CSS, JavaScript, and React while gaining hands-on experience building real-world projects. Whether you're starting from scratch or upskilling, this course equips you with practical tools and current industry standards needed to thrive in today’s fast-moving tech landscape. You'll also develop problem-solving techniques and learn how to collaborate using version control systems like Git. Stay ahead with the latest trends in frontend development, responsive design, and component-based architectures.",
      "price": "Starting Price: ₦200,000",
      "level": "Advance",
      "duration": "6-12 Months",
      "color": "#3B82F6",
      "icon": "💻",
      "features": ["Certificate of completion"],
      "learningOutcomes": [
        "Understand the structure of web pages using HTML5",
        "Create headings, paragraphs, lists, forms, tables, and semantic tags",
        "Learn best practices for clean, accessible markup",
        "Embed images, videos, and iframes",
        "Build the foundation of every web page",
        "Style web pages with colors, layouts, fonts, and animations using CSS",
        "Master Flexbox and Grid for responsive design",
        "Create interactive effects with transitions and hover states",
        "Organize styles using classes, IDs, and pseudo-selectors",
        "Learn media queries for mobile-first development",
        "Add interactivity and logic to web pages using JavaScript",
        "Understand variables, data types, loops, functions, and events",
        "Manipulate the DOM to create dynamic pages",
        "Use Fetch API to load and send data",
        "Learn debugging techniques and JS best practices",
        "Build dynamic, reusable components with React",
        "Understand JSX, state, props, and component lifecycles",
        "Manage application state using hooks like useState and useEffect",
        "Route pages with React Router",
        "Build single-page applications (SPAs)",
        "Integrate APIs and handle async data",
        "Develop real web apps like portfolios, dashboards, and blogs",
        "Use version control with Git & GitHub",
        "Deploy projects online using Netlify or Vercel",
        "Practice problem-solving and responsive design",
        "Build and deploy complete frontend web applications",
        "Create modern, mobile-friendly websites",
        "Build a portfolio of projects showcasing frontend development skills"
      ]
    },
    {
      "id": 3,
      "title": "Cinematography",
      "description": "Learn the art and science of visual storytelling through camera and lighting.",
      "description2": "This course introduces the core principles of cinematography, including camera techniques, shot composition, lighting, and post-production editing. You'll gain hands-on experience in using video equipment, directing scenes, and capturing powerful visuals that tell compelling stories. Ideal for aspiring filmmakers, content creators, and anyone looking to explore the visual side of storytelling through film and video.",
      "price": "Starting Price: ₦40,000",
      "level": "Intermediate",
      "duration": "2-4 Months",
      "color": "#F59E0B",
      "icon": "🎥",
      "features": ["Certificate of completion", "Access to filming equipment"],
      "learningOutcomes": [
        "Introduction to cinematography and visual storytelling",
        "Understanding camera types, lenses, and basic operations",
        "Mastering the rules of composition and framing",
        "Using lighting setups to create mood and enhance visuals",
        "Shooting techniques: handheld, tripod, dolly, and more",
        "Understanding exposure, aperture, ISO, and shutter speed",
        "Directing simple scenes and coordinating small shoots",
        "Recording and syncing clean audio during video production",
        "Basic video editing and post-production workflows",
        "Color grading fundamentals and visual consistency",
        "Creating short videos and storytelling projects",
        "Portfolio development: documenting and presenting your work"
      ]
    }
  ],
  "products": [
    {
      "id": 1,
      "title": "Gaming Mechanical Keyboard",
      "price": "₦129,000",
      "originalPrice": "₦159,000",
      "image": "/placeholder.svg?height=200&width=200",
      "color": "#3B82F6"
    }
  ]
}
